{
  "recipes": [
    {
      "id": 1,
      "name": "Creamy Mushroom & Vegan Chicken",
      "description": "Creamy mushroom & vegan chicken with pasta sauce.",
      "ingredients": [
        "1 tbs Olive Oil",
        "2 cloves Garlic, smashed",
        "1 Shallot, chopped fine",
        "150g Chestnut Mushrooms, finely sliced",
        "1/2 cup/125ml White Wine",
        "1 cup/250ml Vegan Cream",
        "1 tbs English Mustard",
        "1 cup/100g Vegan ‘Chicken’ Pieces (optional – replace with chickpeas or beans)",
        "1 tbs Chopped Fresh Tarragon",
        "Pinch Sea Salt & Pepper",
        "2 Servings Cooked Pasta, of your choice"
      ],
      "nutrition": [],
      "spices": [],
      "instructions": [
        "Place a non stick frying pan over a medium heat & add the oil.",
        "When the pan is hot add shallot, garlic, mushrooms & vegan chicken.",
        "Sauté the mix for 2-3 minutes until lovely & golden, then deglaze the pan with the white wine.",
        "Let the wine bubble away for 30 seconds to cook off the alcohol then add the vegan cream & mustard & stir well.",
        "Let the sauce bubble for a minute or so then season with salt & pepper + add the tarragon.",
        "Stir through your cooked pasta & serve. I like to garnish with a few chilli flakes."
      ],
      "tips": [],
      "prep-time": null,
      "cooking-time": 10,
      "serves": "2-3",
      "difficulty": 3,
      "cuisine": "Pasta",
      "calories": null,
      "tags": [
        "pasta",
        "vegan chicken",
        "mushrooms",
        "creamy pasta",
        "easy to make"
      ],
      "slug": "creamy-mushroom-vegan-chicken"
    },
    {
      "id": 2,
      "name": "Creamy Bean Soup with Sausage",
      "description": "An ultra creamy bean soup with sausage. This soup isn’t one of those all day simmering affairs. So quick and easy to make, yet hearty and full of flavor. It’s rich and  tomatoey, jazzed up with Parmesan and topped with a delicious punchy, red pesto. A knock out 30 minute meal. Serve with a side of crusty bread for a mouthwatering result.",
      "ingredients": [
        "450 g Italian sausage mild or spicy, no casings",
        "2 tbsp olive oil",
        "2 garlic cloves",
        "1 small onion",
        "700 ml chicken broth",
        "120 ml puréed tomatoes",
        "90 g tomato paste",
        "3 cans (360 g/13 oz) cannellini beans drained and rinsed",
        "200 ml heavy cream",
        "45 g grated Parmesan",
        "2 tbsp chopped parsley",
        "8 tbsp red pesto for serving"
      ],
      "nutrition": [
        "Serving: 0g",
        "Calories: 732kcal",
        "Carbohydrates: 14g",
        "Protein: 24g",
        "Fat: 65g",
        "Saturated Fat: 26g",
        "Polyunsaturated Fat: 6g",
        "Monounsaturated Fat: 26g",
        "Cholesterol: 152mg",
        "Sodium: 2707mg",
        "Potassium: 615mg",
        "Fiber: 2g",
        "Sugar: 7g",
        "Vitamin A: 1282IU",
        "Vitamin C: 9mg",
        "Calcium: 201mg",
        "Iron: 3mg"
      ],
      "spices": [
        "1 tsp salt",
        "1 tsp black pepper",
        "1 tsp dried thyme",
        "1 tsp dried oregano",
        "½ tsp fennel seeds",
        "½ tsp crushed red pepper flakes"
      ],
      "instructions": [
        "Get all the prep done before you start cooking: mince the garlic and finely chop the onion. Remove the casings from your sausage. Drain and rinse the beans.",
        "Heat olive oil in a large pot over medium high. Add sausage, break up the meat into small pieces with a wooden spoon, and cook until browned and no longer pink, about 5 minutes. Add garlic and onion, cook until fragrant, for 3 minutes. Stir in spices, and cook for 1 minute more.",
        "Pour in broth, add puréed tomatoes and tomato paste. Bring to a boil, then add cannellini beans. Stir, lower the heat, cover and simmer for 15 minutes, stirring every now and then.",
        "When ready, pour in cream and stir to combine. Turn off the heat and stir in Parmesan. Finish off with some extra black pepper and parsley. Adjust salt to taste.",
        "Serve with crusty bread. Dollop each bowl with red pesto and some red pepper flakes. Enjoy!"
      ],
      "tips": [],
      "prep-time": 5,
      "cooking-time": 25,
      "serves": "4",
      "difficulty": 3,
      "cuisine": "Italian",
      "calories": 732,
      "tags": ["pasta", "vegan chicken", "mushrooms"],
      "slug": "creamy-bean-soup-with-sausage"
    },
    {
      "id": 3,
      "name": "Vegan Potato Salad",
      "description": "This vegan potato salad is creamy, wholesome, herby, zingy and refreshing! The recipe is gluten-free, oil-free and vegan (of course!). It's so easy to make and the ingredients are simple. Expect tender potatoes, with a creamy citrus dressing, fresh herbs and a little crunch from red onion and celery. Certainly, it’s the BEST vegan potato salad you’ll try. ",
      "ingredients": [
        "907 g red potatoes cut into 1 ½ inch pieces",
        "5 ml fine sea salt",
        "2 stalks celery thinly sliced",
        "½ red onion thinly sliced",
        "658 g dill tightly packed, chopped",
        "123 g coconut yogurt",
        "61 g lemon juice or apple cider vinegar",
        "2 cloves garlic finely chopped",
        "30 ml Dijon mustard",
        "5 ml maple syrup",
        "1.23 ml fine sea salt",
        "0.62 ml ground pepper"
      ],
      "nutrition": [
        "Calories: 180kcal",
        "Carbohydrates: 37g",
        "Protein: 8g",
        "Fat: 2g",
        "Saturated Fat: 1g",
        "Sodium: 640mg",
        "Potassium: 1539mg",
        "Fiber: 5g",
        "Sugar: 4g",
        "Vitamin A: 8485IU",
        "Vitamin C: 114mg",
        "Calcium: 278mg",
        "Iron: 8mg"
      ],
      "spices": [],
      "instructions": [
        "In a large pot add the chopped potatoes and sea salt. Fill with water to be 1-inch above the potatoes and bring to a boil on high-heat. Reduce to a simmer on medium-high heat and cook the potatoes until fork tender, about 5 minutes. Strain and rinse with cold water. Transfer to a large mixing bowl. Add the celery, red onion and dill.",
        "In a small bowl, whisk together the Creamy Dressing: coconut yogurt, lemon juice, garlic, Dijon mustard, maple syrup, sea salt and pepper. Pour the dressing over the potato mixture and stir to combine."
      ],
      "tips": [
        "Potato salad can be served immediately, or chill in the fridge until ready to eat.",
        "I recommend using red potatoes for this recipe as they hold their shape when cooked. You can also use white or yellow potatoes, but their high starch content may make the potato salad a little mushy in texture.",
        "Recipe will keep for 5 days. Store in the fridge in an air-tight container."
      ],
      "prep-time": 15,
      "cooking-time": 10,
      "serves": "2-3",
      "difficulty": 3,
      "cuisine": "Pasta",
      "calories": 180,
      "tags": [
        "potatoes",
        "salad",
        "potato salad",
        "creamy pasta",
        "gluten free",
        "easy to make"
      ],
      "slug": "vegan-potato-salad"
    },
    {
      "id": 4,
      "name": "Freddy's pasta in red sauce",
      "description": "Easy to prepare vegan spaghetti and meatballs to die for.",
      "ingredients": [
        "vegan meatballs",
        "spaghetti",
        "400g Pulpa",
        "tomato puree",
        "1 yellow onion",
        "4 garlic cloves",
        "1 teaspoon sugar"
      ],
      "nutrition": [],
      "spices": [],
      "instructions": [
        "Cut up one onion and smash 4 garlic cloves",
        "Add olive oil to a pan cook the onions until brown",
        "Add the garlic and bake for a minute, avoid burning them.",
        "Add 2 spoons of tomatoe puree and one spoon of sugar",
        "Add the 400g of pulpa and combine.",
        "Add spices",
        "Let this slowly cook for up to 15 minutes (longer is even better)",
        "Boil water and cook 200g of spaghetti in water",
        "Prepare the vegan meatball in another pan",
        "Add the cooked spaghetti and some of the water to the sauce and combine.",
        "Enjoy!"
      ],
      "tips": [
        "Boil water for spaghetti after the sauce is starting to slowly cook for the 15 minutes."
      ],
      "prep-time": 5,
      "cooking-time": 15,
      "serves": "2-3",
      "difficulty": 2,
      "cuisine": "Pasta",
      "calories": null,
      "tags": ["italian", "spaghetti", "pasta", "easy to make", "meatballs"],
      "slug": "vegan-spaghetti-meatballs"
    },
    {
      "id": 5,
      "name": "Fresh ginger shots",
      "description": "Easy to make ginger shots recipe.",
      "ingredients": [
        "1/2 cup fresh ginger root",
        "1/4 cup fresh lemon juice",
        "1/4 cup coconut water / tap water",
        "1 tablespoon honey",
        "Dash of turmeric"
      ],
      "nutrition": [],
      "spices": [],
      "instructions": [
        "Wash the ginger root but leave the peel intact",
        "Chop the ginger root into large chunks and place in blender",
        "Pour in lemon juice, water, honey and turmeric.",
        "Blend it all together",
        "Place a fine mesh strainer over a measuring pitcher or glass, pour the contents from the blender in and use a spatula to press down on the thick pulp",
        "Pour the strained juice left over into a glass container"
      ],
      "tips": [
        "Use the 100ml cup and measure out your gingner roots. Then use half the amount in cups for lemon juice and water."
      ],
      "prep-time": 15,
      "cooking-time": 0,
      "serves": "2-3",
      "difficulty": 1,
      "cuisine": "Health",
      "calories": null,
      "tags": ["health", "ginger"],
      "slug": "ginger-shots"
    },
    {
      "id": 6,
      "name": "Tofu Butter Chicken",
      "description": "This dish was inspired by one of the world's most popular Indian dishes, butter chicken. We just replaced the chicken with wonderful tofu and made the recipe speedy!  Next time you're in the mood for a rich, creamy curry that's full of flavour and completely reliable, give this recipe a whirl",
      "ingredients": [
        "2 x 225g block of firm tofu",
        "vegetable oil for frying",
        "1 green chilli",
        "Plant-based Naan bread or Roti - optional",
        "handful of coriander leaves",
        "2 limes",
        "2 tsp garam masala",
        "2 tsp ground coriander",
        "2 tsp ground cumin",
        "2 tsp turmeric",
        "1 tbsp tomato purée",
        "400ml Passata",
        "200ml coconut cream - or oat cream",
        "1 onion",
        "1 garlic clove",
        "1 thumb-sized piece of ginger - peeled",
        "Salt & pepper to taste"
      ],
      "nutrition": [],
      "spices": [],
      "instructions": [
        "Add 1 tablespoon of the plant-based butter to a frying pan or casserole and set over a medium-high heat",
        "Peel and roughly chop the onion and add it to the pan with pinch of salt • Fry for 3–4 minutes, stirring occasionally",
        "Add the spices and cook for 1 minute",
        "Peel the garlic then grate the garlic and ginger directly into the pan",
        "Add the tomato purée and fry for 2 minutes",
        "Pour the passata into the pan, bring to the boil, then reduce to a simmer",
        "Leave to bubble while you make the puffs",
        "Pour a 1cm depth of oil into the second frying pan and set it over a high heat",
        "Pat the tofu dry with kitchen paper and tear it into bite-sized chunks",
        "Put the cornflour and salt into a sandwich bag or Tupperware container",
        "Add the tofu chunks and shake until the chunks are well dusted",
        "Carefully lower the dusted tofu pieces into the hot oil and cook until golden, crispy and puffed up, increasing the heat if necessary",
        "Remove to drain on the plate lined with kitchen paper",
        "Heat the rice pouches in the microwave according to the packet instructions",
        "Slice the limes into wedges",
        "Finely slice the green chilli",
        "Add the plant-based cream and the remaining tablespoon of plant-based butter to the pan",
        "Season with salt and pepper",
        "Tip the puffed tofu into the curry sauce and stir until coated",
        "Divide the curry between bowls",
        "Scatter with coriander leaves and green chilli",
        "Serve with the rice, lime wedges and naans or roti, if you like"
      ],
      "tips": [],
      "prep-time": 30,
      "cooking-time": 20,
      "serves": "2-3",
      "difficulty": 3,
      "cuisine": "Indian",
      "calories": null,
      "tags": ["indian", "curry", "tofu", "butter chicken"],
      "slug": "tofu-butter-chicken"
    }
  ]
}
